Autodesk.Navisworks.Api.SavedViewpointAnimationCut
Simple cut from one frame in an animation to another.

Autodesk.Navisworks.Api.SavedViewpointAnimationCut.#ctor
Default constructor

Autodesk.Navisworks.Api.SavedViewpointAnimationCut.Delay
Time in seconds of the delay
Throws System.ObjectDisposedException:
Object has been Disposed
Throws System.NotSupportedException:
Object is Read-Only

Autodesk.Navisworks.Api.SavedViewpointAnimationCut.IsReadOnly
Gets a value indicating whether the object is read-only.